let _levels = [
	[
		[
			[ "🌑", 10, 25,  0.0, 0.0,   1e10, 20, 40 ],
			[ "🚀", 70, 20, -0.1, -0.02, 1e3,  5 ],
			[ "🛰️", 70, 50,  0.0, 0.0,   1e3,  5 ],
			[ "🛰️", 60, 70,  0.0, 0.0,   1e3,  5 ],
		],
		1
	],
	
	// first level
	[
		// bodies
		[
			// icon, position.x, position.y, velocity.x, velocity.y, mass, diameter, influenceDistance
			[ "🌑", 30, 70, 0.0, 0.0, 1e10, 20, 40 ],
			[ "🌑", 20, 20, 0.0, 0.0, 1e11, 5 ],
			[ "🚀", 40, 20, 0.0, 0.5, 1e9, 5 ],
			[ "🛰️", 50, 20, 0.0, 0.5, 1e9, 5 ],
		],
		// stepSize
		1
	],
];
